Revit 2024 API
BarTypeDiameterOptions.BarNominalDiameter Property
 Represents the bar nominal diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public double BarNominalDiameter { get; set; }
Visual Basic
Public Property BarNominalDiameter As Double
	Get
	Set
Visual C++
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace